import { type IFeedback, EFeedbackOrigins } from '@/static/feedbackUtils';

export const feedbacks: IFeedback[] = [
  {
    avatar: 'Розалина.gen.webp',
    name: 'Розалина',
    date: '2024-07-08T21:42',
    text: 'С Олесей Генадьевной мы занимаемся уже больше года, и продолжаем идти к цели вперёд🔥, она большой профессионал своего дела. Китайский язык очень сложен в изучении, но с ней кажется что любое задание тебе по силам✨ Я очень ей благодарна за всё время и проделанную работу, однозначно, лучший преподаватель😻',
    origin: EFeedbackOrigins.VK,
    extras: {
      vkExtras: {
        likes: 3,
      },
      avitoExtras: null,
    },
  },
  {
    avatar: 'Alfred.gen.webp',
    name: 'Alfred',
    date: '2024-07-09T14:17',
    text: 'Из-за того что в университете преподавали китайский сумбурно и я мало что понимала, то обратилась за помощью к Олесе Геннадьевне. Мы занимаемся уже около 7 месяцев и уже есть прогресс! Когда что-то не понятно на занятиях, мы разбираем тему, грамматику или же задание 👀 С Олесей Генадьевной я начала чувствовать себя уверенно в китайском языке и хочу сказать большое спасибо за проделанную работу🌹 Надеюсь и дальше заниматься с вами!',
    origin: EFeedbackOrigins.VK,
    extras: {
      vkExtras: {
        likes: 2,
      },
      avitoExtras: null,
    },
  },
  {
    avatar: 'Наталья.gen.webp',
    name: 'Наталья',
    date: '2024-07-09T14:17',
    text: 'Начинала заниматься в школе с нуля в 55 лет, с Олесей, потом были другие преподаватели. Потом опять попросилась к Олесе. Мне очень нравится как Олеся даёт материал, всегда интересно на занятиях. Китайский язык не простой , от учителя много зависит, но успех в любом случае зависит и от вас, без труда тут не получится! В общем, очень благодарна Олесе за её любовь к предмету!❤',
    origin: EFeedbackOrigins.VK,
    extras: {
      vkExtras: {
        likes: 132,
      },
      avitoExtras: null,
    },
  },
];
